zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32ck_sg_gc/pic32ck_sg01/pic32ck1012sg01100-pinctrl.h
#define PD5M_GCLK_IO3 MCHP_PINMUX(d, 5, m, periph)

#define PD6_GPIO MCHP_PINMUX(d, 6, gpio, gpio)

#define PD6A_EIC_EXTINT6 MCHP_PINMUX(d, 6, a, periph)

#define PD6C_SERCOM0_PAD0 MCHP_PINMUX(d, 6, c, periph)

#define PD6D_SERCOM1_PAD2 MCHP_PINMUX(d, 6, d, periph)

#define PD6F_TCC2_WO4 MCHP_PINMUX(d, 6, f, periph)

#define PD6G_TCC2_WO1 MCHP_PINMUX(d, 6, g, periph)

#define PD6H_SQI_CS0 MCHP_PINMUX(d, 6, h, periph)

#define PD6I_SDMMC0_SDCMD MCHP_PINMUX(d, 6, i, periph)

#define PD6J_SPI_IXS_FSYNC MCHP_PINMUX(d, 6, j, periph)

#define PD6L_ETH_MDIO MCHP_PINMUX(d, 6, l, periph)

#define PD6M_GCLK_IO4 MCHP_PINMUX(d, 6, m, periph)

#define PD6O_ETH_MDIO MCHP_PINMUX(d, 6, o, periph)

#define PD7_GPIO MCHP_PINMUX(d, 7, gpio, gpio)

#define PD7A_EIC_EXTINT7 MCHP_PINMUX(d, 7, a, periph)

#define PD7C_SERCOM0_PAD1 MCHP_PINMUX(d, 7, c, periph)

#define PD7D_SERCOM1_PAD3 MCHP_PINMUX(d, 7, d, periph)

#define PD7F_TCC2_WO5 MCHP_PINMUX(d, 7, f, periph)

#define PD7G_TCC2_WO2 MCHP_PINMUX(d, 7, g, periph)

#define PD7H_SQI_DATA0 MCHP_PINMUX(d, 7, h, periph)

#define PD7I_SDMMC0_SDDAT0 MCHP_PINMUX(d, 7, i, periph)

#define PD7J_SPI_IXS_SDI MCHP_PINMUX(d, 7, j, periph)

#define PD7L_ETH_MDC MCHP_PINMUX(d, 7, l, periph)

#define PD7M_GCLK_IO5 MCHP_PINMUX(d, 7, m, periph)

#define PD7O_ETH_MDC MCHP_PINMUX(d, 7, o, periph)

#define PD8_GPIO MCHP_PINMUX(d, 8, gpio, gpio)

#define PD8A_EIC_EXTINT8 MCHP_PINMUX(d, 8, a, periph)

#define PD8C_SERCOM1_PAD0 MCHP_PINMUX(d, 8, c, periph)

#define PD8G_TCC2_WO3 MCHP_PINMUX(d, 8, g, periph)

#define PD8H_SQI_DATA2 MCHP_PINMUX(d, 8, h, periph)

#define PD8I_SDMMC0_SDDAT2 MCHP_PINMUX(d, 8, i, periph)

#define PD8J_SPI_IXS_SDO MCHP_PINMUX(d, 8, j, periph)

#define PD8M_CCL_IN6 MCHP_PINMUX(d, 8, m, periph)

#define PD9_GPIO MCHP_PINMUX(d, 9, gpio, gpio)

#define PD9A_EIC_EXTINT9 MCHP_PINMUX(d, 9, a, periph)

#define PD9C_SERCOM1_PAD1 MCHP_PINMUX(d, 9, c, periph)

#define PD9G_TCC2_WO4 MCHP_PINMUX(d, 9, g, periph)

#define PD9H_SQI_DATA3 MCHP_PINMUX(d, 9, h, periph)

#define PD9I_SDMMC0_SDDAT3 MCHP_PINMUX(d, 9, i, periph)

#define PD9M_CCL_IN7 MCHP_PINMUX(d, 9, m, periph)

#define PD10_GPIO MCHP_PINMUX(d, 10, gpio, gpio)

#define PD10A_EIC_EXTINT10 MCHP_PINMUX(d, 10, a, periph)

#define PD10C_SERCOM1_PAD2 MCHP_PINMUX(d, 10, c, periph)

#define PD10G_TCC2_WO5 MCHP_PINMUX(d, 10, g, periph)

#define PD10H_SQI_CLK MCHP_PINMUX(d, 10, h, periph)

#define PD10I_SDMMC0_SDCK MCHP_PINMUX(d, 10, i, periph)

#define PD10J_SPI_IXS_SCK MCHP_PINMUX(d, 10, j, periph)

#define PD10M_CCL_IN8 MCHP_PINMUX(d, 10, m, periph)

#define PD11_GPIO MCHP_PINMUX(d, 11, gpio, gpio)

#define PD11A_EIC_EXTINT11 MCHP_PINMUX(d, 11, a, periph)

#define PD11C_SERCOM1_PAD3 MCHP_PINMUX(d, 11, c, periph)

#define PD11F_TCC2_WO2 MCHP_PINMUX(d, 11, f, periph)

#define PD11G_TCC2_WO6 MCHP_PINMUX(d, 11, g, periph)

#define PD11H_SQI_DATA1 MCHP_PINMUX(d, 11, h, periph)

#define PD11I_SDMMC0_SDDAT1 MCHP_PINMUX(d, 11, i, periph)

#define PD11M_CCL_OUT2 MCHP_PINMUX(d, 11, m, periph)

#define PD12_GPIO MCHP_PINMUX(d, 12, gpio, gpio)

#define PD12A_EIC_EXTINT12 MCHP_PINMUX(d, 12, a, periph)

#define PD12C_SERCOM0_PAD3 MCHP_PINMUX(d, 12, c, periph)

#define PD12F_TCC2_WO1 MCHP_PINMUX(d, 12, f, periph)

#define PD12G_TCC2_WO7 MCHP_PINMUX(d, 12, g, periph)

#define PD12H_SQI_CS3 MCHP_PINMUX(d, 12, h, periph)

#define PD12I_SDMMC0_SDCD MCHP_PINMUX(d, 12, i, periph)

#define PD12M_GCLK_IO2 MCHP_PINMUX(d, 12, m, periph)

#endif /* MICROCHIP_PIC32CK1012SG01100_PINCTRL_H_ */
